Ran Plan for 3 projects:

1. project: `main-us-east-1-midway-auth` dir: `live/main-account/us-east-1/midway-auth` workspace: `default`
1. project: `secondary-us-east-1-ray-dashboard` dir: `live/secondary-account/us-east-1/ray-dashboard` workspace: `default`
1. project: `main-us-east-1-argocd` dir: `live/main-account/us-east-1/argocd` workspace: `default`
---

### 1. project: `main-us-east-1-midway-auth` dir: `live/main-account/us-east-1/midway-auth` workspace: `default`
**Plan Error**
```
the default workspace at path live/main-account/us-east-1/midway-auth is currently locked by another command that is running for this pull request.
Wait until the previous command is complete and try again
```

---
### 2. project: `secondary-us-east-1-ray-dashboard` dir: `live/secondary-account/us-east-1/ray-dashboard` workspace: `default`
<details><summary>Show Output</summary>

```diff
06:46:22.197 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
06:47:10.139 STDOUT terraform: data.aws_eks_cluster_auth.cluster: Reading...
06:47:10.141 STDOUT terraform: data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=ml-training-secondary-us-east-1]
06:47:10.448 STDOUT terraform: Terraform used the selected providers to generate the following execution
06:47:10.448 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
06:47:10.448 STDOUT terraform:   + create
06:47:10.448 STDOUT terraform: Terraform will perform the following actions:
06:47:10.448 STDOUT terraform:   # aws_acm_certificate.ray_dashboard will be created
06:47:10.448 STDOUT terraform:   + resource "aws_acm_certificate" "ray_dashboard" {
06:47:10.448 STDOUT terraform:       + arn                       = (known after apply)
06:47:10.448 STDOUT terraform:       + domain_name               = "ray-dashboard-us-east-1-159553542841.mlkeita.people.aws.dev"
06:47:10.448 STDOUT terraform:       + domain_validation_options = [
06:47:10.448 STDOUT terraform:           + {
06:47:10.448 STDOUT terraform:               + domain_name           = "ray-dashboard-us-east-1-159553542841.mlkeita.people.aws.dev"
06:47:10.448 STDOUT terraform:               + resource_record_name  = (known after apply)
06:47:10.448 STDOUT terraform:               + resource_record_type  = (known after apply)
06:47:10.448 STDOUT terraform:               + resource_record_value = (known after apply)
06:47:10.448 STDOUT terraform:             },
06:47:10.448 STDOUT terraform:         ]
06:47:10.449 STDOUT terraform:       + id                        = (known after apply)
06:47:10.449 STDOUT terraform:       + key_algorithm             = (known after apply)
06:47:10.449 STDOUT terraform:       + not_after                 = (known after apply)
06:47:10.449 STDOUT terraform:       + not_before                = (known after apply)
06:47:10.449 STDOUT terraform:       + pending_renewal           = (known after apply)
06:47:10.449 STDOUT terraform:       + region                    = "us-east-1"
06:47:10.449 STDOUT terraform:       + renewal_eligibility       = (known after apply)
06:47:10.449 STDOUT terraform:       + renewal_summary           = (known after apply)
06:47:10.449 STDOUT terraform:       + status                    = (known after apply)
06:47:10.449 STDOUT terraform:       + subject_alternative_names = [
06:47:10.449 STDOUT terraform:           + "ray-dashboard-us-east-1-159553542841.mlkeita.people.aws.dev",
06:47:10.449 STDOUT terraform:         ]
06:47:10.449 STDOUT terraform:       + tags                      = {
06:47:10.449 STDOUT terraform:           + "Module" = "ray-dashboard-ingress"
06:47:10.449 STDOUT terraform:         }
06:47:10.449 STDOUT terraform:       + tags_all                  = {
06:47:10.449 STDOUT terraform:           + "Account"    = "secondary"
06:47:10.449 STDOUT terraform:           + "ManagedBy"  = "terraform"
06:47:10.449 STDOUT terraform:           + "Module"     = "ray-dashboard-ingress"
06:47:10.449 STDOUT terraform:           + "Region"     = "us-east-1"
06:47:10.449 STDOUT terraform:           + "Repository" = "ml-clusters"
06:47:10.449 STDOUT terraform:         }
06:47:10.450 STDOUT terraform:       + type                      = (known after apply)
06:47:10.450 STDOUT terraform:       + validation_emails         = (known after apply)
06:47:10.450 STDOUT terraform:       + validation_method         = "DNS"
06:47:10.450 STDOUT terraform:       + options (known after apply)
06:47:10.450 STDOUT terraform:     }
06:47:10.450 STDOUT terraform:   # aws_acm_certificate_validation.ray_dashboard will be created
06:47:10.450 STDOUT terraform:   + resource "aws_acm_certificate_validation" "ray_dashboard" {
06:47:10.450 STDOUT terraform:       + certificate_arn         = (known after apply)
06:47:10.450 STDOUT terraform:       + id                      = (known after apply)
06:47:10.450 STDOUT terraform:       + region                  = "us-east-1"
06:47:10.450 STDOUT terraform:       + validation_record_fqdns = (known after apply)
06:47:10.450 STDOUT terraform:     }
06:47:10.450 STDOUT terraform:   # aws_route53_record.cert_validation["ray-dashboard-us-east-1-159553542841.mlkeita.people.aws.dev"] will be created
06:47:10.450 STDOUT terraform:   + resource "aws_route53_record" "cert_validation" {
06:47:10.450 STDOUT terraform:       + allow_overwrite = true
06:47:10.450 STDOUT terraform:       + fqdn            = (known after apply)
06:47:10.450 STDOUT terraform:       + id              = (known after apply)
06:47:10.450 STDOUT terraform:       + name            = (known after apply)
06:47:10.450 STDOUT terraform:       + records         = (known after apply)
06:47:10.450 STDOUT terraform:       + ttl             = 60
06:47:10.450 STDOUT terraform:       + type            = (known after apply)
06:47:10.450 STDOUT terraform:       + zone_id         = "Z0877883J7LIJICLIFXY"
06:47:10.450 STDOUT terraform:     }
06:47:10.450 STDOUT terraform:   # kubernetes_secret_v1.oidc_credentials will be created
06:47:10.450 STDOUT terraform:   + resource "kubernetes_secret_v1" "oidc_credentials" {
06:47:10.451 STDOUT terraform:       + data                           = (sensitive value)
06:47:10.451 STDOUT terraform:       + id                             = (known after apply)
06:47:10.451 STDOUT terraform:       + type                           = "Opaque"
06:47:10.451 STDOUT terraform:       + wait_for_service_account_token = true
06:47:10.451 STDOUT terraform:       + metadata {
06:47:10.451 STDOUT terraform:           + generation       = (known after apply)
06:47:10.451 STDOUT terraform:           + name             = "ray-dashboard-oidc"
06:47:10.451 STDOUT terraform:           + namespace        = "kuberay"
06:47:10.451 STDOUT terraform:           + resource_version = (known after apply)
06:47:10.451 STDOUT terraform:           + uid              = (known after apply)
06:47:10.451 STDOUT terraform:         }
06:47:10.451 STDOUT terraform:     }
06:47:10.451 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
06:47:10.451 STDOUT terraform: Changes to Outputs:
06:47:10.451 STDOUT terraform:   + acm_certificate_arn = (known after apply)
06:47:10.451 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
06:47:10.451 STDOUT terraform: Saved the plan to:
06:47:10.451 STDOUT terraform: ./secondary-us-east-1-ray-dashboard-default.tfplan
06:47:10.451 STDOUT terraform: To perform exactly these actions, run the following command to apply:
06:47:10.451 STDOUT terraform:     terraform apply "./secondary-us-east-1-ray-dashboard-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p secondary-us-east-1-ray-dashboard
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fsecondary-account%252Fus-east-1%252Fray-dashboard%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p secondary-us-east-1-ray-dashboard
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `main-us-east-1-argocd` dir: `live/main-account/us-east-1/argocd` workspace: `default`
<details><summary>Show Output</summary>

```diff
06:46:22.249 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
06:46:37.585 WARN   Config ../../../secondary-account/us-east-1/ray-dashboard/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
06:47:02.778 INFO   Downloading Terraform configurations from ../../../../modules/argocd into ./.terragrunt-cache/DIG9hUdIeKaL1e-_-Z6QUCMzTZY/zjWmR_Zg-IZzeJkL8NFUgBermtI
06:47:02.812 INFO   terraform: Initializing the backend...
06:47:02.887 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
06:47:02.887 INFO   terraform: use this backend unless the backend configuration changes.
06:47:02.971 INFO   terraform: Initializing provider plugins...
06:47:02.972 INFO   terraform: - Finding hashicorp/aws versions matching "~> 6.0"...
06:47:03.000 INFO   terraform: - Finding hashicorp/helm versions matching ">= 2.0.0"...
06:47:03.015 INFO   terraform: - Finding hashicorp/kubernetes versions matching ">= 2.0.0"...
06:47:03.091 INFO   terraform: - Installing hashicorp/kubernetes v3.0.1...
06:47:04.073 INFO   terraform: - Installed hashicorp/kubernetes v3.0.1 (signed by HashiCorp)
06:47:04.135 INFO   terraform: - Installing hashicorp/aws v6.35.1...
06:47:12.693 INFO   terraform: - Installed hashicorp/aws v6.35.1 (signed by HashiCorp)
06:47:12.778 INFO   terraform: - Installing hashicorp/helm v3.1.1...
06:47:13.591 INFO   terraform: - Installed hashicorp/helm v3.1.1 (signed by HashiCorp)
06:47:13.591 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
06:47:13.591 INFO   terraform: selections it made above. Include this file in your version control repository
06:47:13.591 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
06:47:13.591 INFO   terraform: you run "terraform init" in the future.
06:47:13.592 INFO   terraform: Terraform has been successfully initialized!
06:47:13.592 INFO   terraform: You may now begin working with Terraform. Try running "terraform plan" to see
06:47:13.592 INFO   terraform: any changes that are required for your infrastructure. All Terraform commands
06:47:13.592 INFO   terraform: should now work.
06:47:13.592 INFO   terraform: If you ever set or change modules or backend configuration for Terraform,
06:47:13.592 INFO   terraform: rerun this command to reinitialize your working directory. If you forget, other
06:47:13.592 INFO   terraform: commands will detect it and remind you to do so if necessary.
06:47:19.793 STDOUT terraform: data.aws_eks_cluster_auth.hub: Reading...
06:47:19.794 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_permissions: Reading...
06:47:19.794 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_trust: Reading...
06:47:19.795 STDOUT terraform: data.aws_eks_cluster_auth.hub: Read complete after 0s [id=ml-cluster-main-us-east-1]
06:47:19.796 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_permissions: Read complete after 0s [id=1353839944]
06:47:19.797 STDOUT terraform: data.aws_iam_policy_document.argocd_controller_trust: Read complete after 0s [id=2171699374]
06:47:19.933 STDOUT terraform: aws_iam_policy.argocd_controller: Refreshing state... [id=arn:aws:iam::483026362307:policy/ArgoCD-Hub-Controller-Policy]
06:47:19.933 STDOUT terraform: aws_iam_role.argocd_controller: Refreshing state... [id=ArgoCD-Hub-Controller]
06:47:19.938 STDOUT terraform: kubernetes_namespace_v1.argocd: Refreshing state... [id=argocd]
06:47:20.028 STDOUT terraform: aws_iam_role_policy_attachment.argocd_controller: Refreshing state... [id=ArgoCD-Hub-Controller/arn:aws:iam::483026362307:policy/ArgoCD-Hub-Controller-Policy]
06:47:20.031 STDOUT terraform: helm_release.argocd: Refreshing state... [id=argocd]
06:47:20.856 STDOUT terraform: kubernetes_secret_v1.spoke_clusters["ml-cluster-main-us-west-2"]: Refreshing state... [id=argocd/ml-cluster-main-us-west-2]
06:47:20.856 STDOUT terraform: kubernetes_secret_v1.hub_cluster: Refreshing state... [id=argocd/hub-cluster]
06:47:20.857 STDOUT terraform: kubernetes_secret_v1.spoke_clusters["osmo-secondary-us-west-2"]: Refreshing state... [id=argocd/osmo-secondary-us-west-2]
06:47:20.857 STDOUT terraform: kubernetes_secret_v1.spoke_clusters["ml-training-secondary-us-west-2"]: Refreshing state... [id=argocd/ml-training-secondary-us-west-2]
06:47:20.857 STDOUT terraform: kubernetes_secret_v1.spoke_clusters["ml-training-secondary-us-east-1"]: Refreshing state... [id=argocd/ml-training-secondary-us-east-1]
06:47:21.775 STDOUT terraform: kubernetes_manifest.bootstrap_app[0]: Refreshing state...
06:47:22.616 STDOUT terraform: Terraform used the selected providers to generate the following execution
06:47:22.616 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
06:47:22.616 STDOUT terraform:   ~ update in-place
06:47:22.616 STDOUT terraform: Terraform will perform the following actions:
06:47:22.616 STDOUT terraform:   # kubernetes_secret_v1.spoke_clusters["ml-training-secondary-us-east-1"] will be updated in-place
06:47:22.616 STDOUT terraform:   ~ resource "kubernetes_secret_v1" "spoke_clusters" {
06:47:22.616 STDOUT terraform:         id                             = "argocd/ml-training-secondary-us-east-1"
06:47:22.616 STDOUT terraform:         # (4 unchanged attributes hidden)
06:47:22.616 STDOUT terraform:       ~ metadata {
06:47:22.616 STDOUT terraform:           ~ annotations      = {
06:47:22.616 STDOUT terraform:               + "enable_ray_dashboard"       = "true"
06:47:22.616 STDOUT terraform:               + "ray_dashboard_acm_arn"      = "arn:aws:acm:us-east-1:159553542841:certificate/mock"
06:47:22.616 STDOUT terraform:               + "ray_dashboard_hostname"     = "ray-dashboard-us-east-1-159553542841.mlkeita.people.aws.dev"
06:47:22.617 STDOUT terraform:               + "ray_dashboard_oidc_domain"  = "ml-clusters-mlkeita"
06:47:22.617 STDOUT terraform:               + "ray_dashboard_oidc_issuer"  = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_2OXsDuUCs"
06:47:22.617 STDOUT terraform:               + "ray_dashboard_oidc_secret"  = "ray-dashboard-oidc"
06:47:22.617 STDOUT terraform:                 # (18 unchanged elements hidden)
06:47:22.617 STDOUT terraform:             }
06:47:22.617 STDOUT terraform:             name             = "ml-training-secondary-us-east-1"
06:47:22.617 STDOUT terraform:             # (6 unchanged attributes hidden)
06:47:22.617 STDOUT terraform:         }
06:47:22.617 STDOUT terraform:     }
06:47:22.617 STDOUT terraform: Plan: 0 to add, 1 to change, 0 to destroy.
06:47:22.617 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
06:47:22.617 STDOUT terraform: Saved the plan to:
06:47:22.617 STDOUT terraform: ./main-us-east-1-argocd-default.tfplan
06:47:22.617 STDOUT terraform: To perform exactly these actions, run the following command to apply:
06:47:22.617 STDOUT terraform:     terraform apply "./main-us-east-1-argocd-default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p main-us-east-1-argocd
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.mlkeita.people.aws.dev/lock?id=KeitaW%252Fml-clusters%252Flive%252Fmain-account%252Fus-east-1%252Fargocd%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p main-us-east-1-argocd
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### Plan Summary

3 projects, 2 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```